InformationRegisters/НастройкаВопросовДляЭлектронногоТестирования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>НастройкаВопросовДляЭлектронногоТестирования</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Балл</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Вакансии</v8:Type>
						<v8:Type>cfg:CatalogRef.ПрофилиДолжностей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЭлектронныйКурс</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЭлектронныеКурсы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЭтапРаботы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЭтапыРаботыСКандидатами</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВариантОтвета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВариантыОтветовНаТестовыеВопросы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаПерсонала</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ХарактеристикиПерсонала</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗначениеХарактеристики</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗначенияХарактеристикПерсонала</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ХарактеристикиФизическихЛиц.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ХарактеристикиФизическихЛиц</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Балл</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>СпособОценкиХарактеристик</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыОценкиХарактеристик</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьЭтап</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЭтапыРаботыСКандидатами</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Вакансия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Вакансии</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Этап</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЭтапыРаботыСКандидатами</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
						<v8:Type>cfg:CatalogRef.ЛичныеДанныеКандидатов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаПерсонала</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ХарактеристикиПерсонала</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗначениеХарактеристики</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ХарактеристикиПерсонала</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/РаботаСКандидатами.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>РаботаСКандидатами</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЭтапРаботы</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЭтапРаботыСКандидатами</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СостояниеЭтапа</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияЭтаповРаботыСКандидатами</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ШаблонАнкеты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ШаблоныАнкет</v8:Type>
						<v8:Type>cfg:CatalogRef.ЭлектронныеКурсы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПричинаОтклонения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПричиныОтклоненияКандидатов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПериодОкончание</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Бронь</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Бронь</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Организатор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УчетнаяЗаписьВидеоконференции</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УчетныеЗаписиВидеоконференций</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИдентификаторВидеоконференции</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РешениеОПриемеНаРаботу</v8:Type>
						<v8:Type>cfg:DocumentRef.ПриемНаРаботу</v8:Type>
						<v8:Type>cfg:DocumentRef.ПриемНаРаботуСписком</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Кандидат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Кандидаты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/СпособыОценкиХарактеристик.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>СпособыОценкиХарактеристик</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>АнкетаЭлектронногоИнтервью</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭлектронныйТест</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ИспользованиеШаблоновСообщенийПриПодбореПерсонала.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ИспользованиеШаблоновСообщенийПриПодбореПерсонала</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОзнакомлениеСВакансией</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОзнакомлениеСКандидатом</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОзнакомлениеСКандидатами</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОдобрениеКандидата</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтклонениеКандидата</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзменениеЭтапаРаботыСКандидатом</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриглашениеНаЭлектронноеТестирование</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/СостоянияЭтаповРаботыСКандидатами.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>СостоянияЭтаповРаботыСКандидатами</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Запланирован</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Пройден</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Пропущен</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/ШаблоныСообщений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>ШаблоныСообщений</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<BasedOn>
				<xr:Item>Document.ЭлектронноеПисьмоИсходящее</xr:Item>
			</BasedOn>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВладелецШаблона</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ВладелецШаблонаСообщения</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВнешняяОбработка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДополнительныеОтчетыИОбработки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Назначение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отправитель</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтправлятьВТранслите</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолноеИмяТипаПараметраВводаНаОсновании</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредназначенДляSMS</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредназначенДляВводаНаОсновании</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредназначенДляЭлектронныхПисем</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстШаблонаSMS</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстШаблонаПисьма</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстШаблонаПисьмаHTML</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТемаПисьма</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипТекстаПисьма</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыРедактированияЭлектронныхПисем</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТолькоДляАвтора</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТранслитерироватьИменаФайлов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УпаковатьВАрхив</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФорматВложений</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонПоВнешнейОбработке</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодписьИПечать</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПечатныеФормыИВложения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Идентификатор</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Имя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>300</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Параметры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяПараметра</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипПараметра</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПредставлениеПараметра</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/ЭлектронноеТестированиеКандидатов/Ext/Module.bsl
#Область СлужебныйПрограммныйИнтерфейс

#Область ПервоначальноеЗаполнениеИОбновлениеИБ

// Добавляет в список процедуры-обработчики обновления данных ИБ
// для всех поддерживаемых версий библиотеки или конфигурации.
// Вызывается перед началом обновления данных ИБ для построения плана обновления.
//
//
// Параметры:
//   Обработчики - ТаблицаЗначений - см. описание функции НоваяТаблицаОбработчиковОбновления
//                                   общего модуля ОбновлениеИнформационнойБазы.
//
// Пример добавления процедуры-обработчика в список:
//  Обработчик = Обработчики.Добавить();
//  Обработчик.Версия    = "1.0.0.0";
//  Обработчик.Процедура = "ОбновлениеИБ.ПерейтиНаВерсию_1_0_0_0";
// 
//  Все свойства обработчика см. в комментарии к функции
//  НоваяТаблицаОбработчиковОбновления в модуле ОбновлениеИнформационнойБазы.
//
Процедура ЗарегистрироватьОбработчикиОбновления(Обработчики) Экспорт

	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.19.38";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.НачальноеЗаполнение = Истина;
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("784b9e66-3f53-4a11-b08b-7b423cc5d09c");
	Обработчик.Процедура = "ЭлектронноеТестированиеКандидатов.ПриНачальномЗаполненииДанныхПодсистемыЭлектронноеТестированиеКандидатов";
	Обработчик.Комментарий = НСтр("ru = 'Начальное заполнение данных электронного тестирования кандидатов.'");

	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.19.38";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("cb41b09a-4d55-41d9-b053-b8999a3e0cba");
	Обработчик.Процедура = "ЭлектронноеТестированиеКандидатов.ЗаполнитьСпособОценкиХарактеристик";
	Обработчик.Комментарий = НСтр("ru = 'Заполнение способа оценки характеристик в вакансиях и профилях должностей.'");

КонецПроцедуры

// Процедура выполняет начальное заполнение данных подсистемы электронное тестирование кандидатов
//
Процедура ПриНачальномЗаполненииДанныхПодсистемыЭлектронноеТестированиеКандидатов(ПараметрыОбновления = Неопределено) Экспорт

	СоздатьИЗаполнитьГруппуДоступаВнешнегоПользователяКандидата();

КонецПроцедуры

// Процедура выполняет заполнение способа оценки характеристик в вакансиях и профилях должностей
// на тех этапах, где используется электронное интервью.
//
Процедура ЗаполнитьСпособОценкиХарактеристик(ПараметрыОбновления = Неопределено) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ПрофилиДолжностейЭтапыРаботыСКандидатами.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ПрофилиДолжностей.ЭтапыРаботыСКандидатами КАК ПрофилиДолжностейЭтапыРаботыСКандидатами
		|ГДЕ
		|	ПрофилиДолжностейЭтапыРаботыСКандидатами.Ссылка <> ЗНАЧЕНИЕ(Справочник.ШаблоныАнкет.ПустаяСсылка)
		|	И НЕ ПрофилиДолжностейЭтапыРаботыСКандидатами.Ссылка В (&Обработанные)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВакансииЭтапыРаботыСКандидатами.Ссылка
		|ИЗ
		|	Справочник.Вакансии.ЭтапыРаботыСКандидатами КАК ВакансииЭтапыРаботыСКандидатами
		|ГДЕ
		|	ВакансииЭтапыРаботыСКандидатами.ШаблонАнкеты <> ЗНАЧЕНИЕ(Справочник.ШаблоныАнкет.ПустаяСсылка)
		|	И НЕ ВакансииЭтапыРаботыСКандидатами.Ссылка В (&Обработанные)";
	Если Не ПараметрыОбновления.Свойство("Обработанные") Тогда
		Обработанные = Новый Массив;
		ПараметрыОбновления.Вставить("Обработанные");
	ИначеЕсли ПараметрыОбновления.Обработанные = Неопределено Тогда
		Обработанные = Новый Массив;
	Иначе
		Обработанные = ПараметрыОбновления.Обработанные;
	КонецЕсли;
	Запрос.УстановитьПараметр("Обработанные", Обработанные);
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(ПараметрыОбновления,
			"ОбработкаЗавершена", Истина);
		Возврат;
	КонецЕсли;
	
	ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(ПараметрыОбновления,
		"ОбработкаЗавершена", Ложь);
		
	ОбрабатываемыеСправочники = РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Ссылка");
	Для Каждого Ссылка Из ОбрабатываемыеСправочники Цикл
		Обработанные.Добавить(Ссылка);
		ИзменяемыйСправочник = Ссылка.ПолучитьОбъект();
		ЗаписыватьСправочник = Ложь;
		Для Каждого Строка Из ИзменяемыйСправочник.ЭтапыРаботыСКандидатами Цикл
			Если ЗначениеЗаполнено(Строка.ШаблонАнкеты) И Не ЗначениеЗаполнено(Строка.СпособОценкиХарактеристик) Тогда
				ЗаписыватьСправочник = Истина;
				Строка.СпособОценкиХарактеристик = Перечисления.СпособыОценкиХарактеристик.АнкетаЭлектронногоИнтервью;
			КонецЕсли;
		КонецЦикла;
		
		Если Не ЗаписыватьСправочник Тогда
			Продолжить;
		КонецЕсли;
		
		ИмяПространстваБлокировки = СтрШаблон("Справочник.%1", Ссылка.Метаданные().Имя);
		
		Если Не ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ПодготовитьОбновлениеДанных(ПараметрыОбновления,
			ИмяПространстваБлокировки, "Ссылка", Ссылка) Тогда
			Продолжить;
		КонецЕсли;
		
		ОбновлениеИнформационнойБазы.ЗаписатьОбъект(ИзменяемыйСправочник);
		ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ЗавершитьОбновлениеДанных(ПараметрыОбновления);
		
	КонецЦикла;
	
	ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(ПараметрыОбновления, "Обработанные",
		Обработанные);

КонецПроцедуры

#КонецОбласти

// См. ПользователиПереопределяемый.ПриОпределенииНазначенияРолей.
// 
// Параметры:
//  НазначениеРолей - см. ПользователиПереопределяемый.ПриОпределенииНазначенияРолей.НазначениеРолей
//
Процедура ПриОпределенииНазначенияРолей(НазначениеРолей) Экспорт

	НазначениеРолей.ТолькоДляВнешнихПользователей.Добавить(
		Метаданные.Роли.ЭлектронноеТестированиеКандидатовВнешнийПользовательБазовыеПрава.Имя);
	НазначениеРолей.СовместноДляПользователейИВнешнихПользователей.Добавить(
		Метаданные.Роли.БазовыеПраваЭлектронногоОбучения.Имя);

КонецПроцедуры

Процедура ЗаполнитьПоставляемыеПрофилиГруппДоступа(ОписанияПрофилей, ПараметрыОбновления) Экспорт

	ОписаниеПрофиля = ОписаниеПрофиляКандидат();
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);

КонецПроцедуры

// Создает новый шаблон сообщений приглашение
//
Процедура СформироватьШаблонПриглашенияНаТестирование() Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ШаблоныСообщений.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ШаблоныСообщений КАК ШаблоныСообщений
		|ГДЕ
		|	(ШаблоныСообщений.ВладелецШаблона = ЗНАЧЕНИЕ(Перечисление.ИспользованиеШаблоновСообщенийПриПодбореПерсонала.ПриглашениеНаЭлектронноеТестирование))";

	Если Не Запрос.Выполнить().Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	// Приглашение на электронное тестирование (письмо).
	ПараметрыШаблона = ШаблоныСообщений.ОписаниеПараметровШаблона();
	ПараметрыШаблона.ПолноеИмяТипаНазначения = Метаданные.Справочники.Кандидаты.ПолноеИмя();
	ПараметрыШаблона.Назначение = Метаданные.Справочники.Кандидаты.Синоним;
	ПараметрыШаблона.ТипШаблона = "Письмо";
	Если ПолучитьФункциональнуюОпцию("ИспользоватьПочтовыйКлиент") 
		И Не ПолучитьФункциональнуюОпцию("ОтправлятьПисьмаВФорматеHTML") Тогда
		ПараметрыШаблона.ФорматПисьма = Перечисления.СпособыРедактированияЭлектронныхПисем.ОбычныйТекст;
	КонецЕсли;
	ПараметрыШаблона.Тема = НСтр("ru = 'Приглашение на электронное тестирование'");
	ПараметрыШаблона.Текст = НСтр("ru = 'Добрый день, [Кандидаты.ЛичныеДанные.Имя] [Кандидаты.ЛичныеДанные.Отчество]!
								  |
								  |Наша компания [Кандидаты.Организация.Наименование] приглашает пройти тестирование на вакансию «[Кандидаты.Вакансия]».
								  |
								  |Прямая ссылка: [АвторизацияВнешнегоПользователя.ВебСсылкаПереходаВСистему]
								  |Пользователь: [АвторизацияВнешнегоПользователя.ИмяПользователяИБ]
								  |Пароль: [АвторизацияВнешнегоПользователя.Пароль]
								  |
								  |С уважением, служба персонала [Кандидаты.Организация.Наименование].'");
	ПараметрыШаблона.ВладелецШаблона = Перечисления.ИспользованиеШаблоновСообщенийПриПодбореПерсонала.ПриглашениеНаЭлектронноеТестирование;
	ШаблоныСообщений.СоздатьШаблон(НСтр("ru = 'Приглашение на электронное тестирование (письмо)'"), ПараметрыШаблона);

КонецПроцедуры

Процедура ПриСозданииФормыЭлектронногоКурса(ПараметрыФормы, СтандартнаяОбработка) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	Если ТипЗнч(ПараметрыФормы.Контекст) = Тип("СправочникСсылка.Вакансии") И ЗначениеЗаполнено(ПараметрыФормы.Контекст) Тогда
		СтандартнаяОбработка = Ложь;
		ПараметрыФормы.Заголовок = СтрШаблон(НСтр("ru = 'Тестирование на вакансию %1'"), Строка(ПараметрыФормы.Контекст));
		НастройкиТеста = РазработкаЭлектронныхКурсов.НастройкиТеста(ПараметрыФормы.ЭлектронныйКурс);
		Если Не НастройкиТеста.ПоказыватьСтатистику Тогда
			ПараметрыФормы.ЗакрыватьПослеОкончанияОбучения = Истина;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Функция ТаблицаОтветовТеста(Вакансия, ЛичныеДанныеКандидатов) Экспорт
	
	РезультатыТеста = ТаблицаОтветов();
	
	Если Не ЗначениеЗаполнено(Вакансия) Тогда
		Возврат РезультатыТеста;
	КонецЕсли;
	
	ТестыНаЭтапе = ТестыСЭтапамиРабот(Вакансия);
	
	ДанныеВакансии = Справочники.Вакансии.ДанныеВакансии(Вакансия);
	ВакансияСоответствуетПрофилю = ДанныеВакансии.СоответствуетПрофилюДолжности;
	ВакансияПрофильДолжности = ДанныеВакансии.ПрофильДолжности;
	
	Если ТестыНаЭтапе = Неопределено Тогда
		Возврат РезультатыТеста;
	КонецЕсли;
	
	Для Каждого ТестНаЭтапе Из ТестыНаЭтапе Цикл
		Для Каждого ЛичныеДанныеКандидата Из ЛичныеДанныеКандидатов Цикл
			ИзучениеЭлектронногоКурса = ИзучениеЭлектронныхКурсов.НайтиИзучениеПоКонтексту(ТестНаЭтапе.ЭлектронныйКурс,
				Вакансия, ЛичныеДанныеКандидата.Значение);
			Если Не ЗначениеЗаполнено(ИзучениеЭлектронногоКурса) Тогда
				Продолжить;
			КонецЕсли;
			ДанныеОбИзучении = ИзучениеЭлектронныхКурсов.ДанныеОбИзученииЭлектронногоКурса(ИзучениеЭлектронногоКурса, Истина);
			Для Каждого Тест Из ДанныеОбИзучении.ИзученныеЭлементы Цикл
				ПопыткиИзучений = Тест.ПопыткиИзучения;
				КоличествоПопыток = ПопыткиИзучений.Количество();
				Если КоличествоПопыток = 0 Тогда
					Продолжить;
				КонецЕсли;
				ПоследняяПопытка = ПопыткиИзучений[КоличествоПопыток - 1];
				Для Каждого ОтветНаВопрос Из ПоследняяПопытка.ОтветыНаТестовыеВопросы Цикл
					Для Каждого ВыбранныйВариант Из ОтветНаВопрос.ВыбранныеВариантыОтветов Цикл
						Строка = РезультатыТеста.Добавить();
						Если ВакансияСоответствуетПрофилю Тогда
							Строка.Объект = ВакансияПрофильДолжности;
						Иначе
							Строка.Объект = Вакансия;
						КонецЕсли;
						Строка.ЭлектронныйКурс = ТестНаЭтапе.ЭлектронныйКурс;
						Строка.ЛичныеДанныеКандидата = ЛичныеДанныеКандидата.Значение;
						Строка.Вопрос = ОтветНаВопрос.Вопрос;
						Строка.ВариантОтвета = ВыбранныйВариант.ВариантОтвета;
						Строка.Выбран = ?(ВыбранныйВариант.Выбран, Истина, Ложь);
						Строка.Вакансия = Вакансия;
						Строка.ЭтапРаботы = ТестНаЭтапе.ЭтапРаботы;
					КонецЦикла;
				КонецЦикла;
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	
	Возврат РезультатыТеста;
	
КонецФункции

Функция ПолученныйБаллПоОтветуТеста(ВариантОтвета, ХарактеристикаПерсонала, ЗначениеХарактеристики, ОбъектОценки) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЕСТЬNULL(НастройкаВопросовДляЭлектронногоТестирования.Балл, 0) КАК Балл
		|ИЗ
		|	РегистрСведений.НастройкаВопросовДляЭлектронногоТестирования КАК НастройкаВопросовДляЭлектронногоТестирования
		|ГДЕ
		|	НастройкаВопросовДляЭлектронногоТестирования.ВариантОтвета = &ВариантОтвета
		|	И НастройкаВопросовДляЭлектронногоТестирования.ХарактеристикаПерсонала = &ХарактеристикаПерсонала
		|	И НастройкаВопросовДляЭлектронногоТестирования.ЗначениеХарактеристики = &ЗначениеХарактеристики
		|	И НастройкаВопросовДляЭлектронногоТестирования.Объект = &ОбъектОценки";
	Запрос.УстановитьПараметр("ВариантОтвета", ВариантОтвета);
	Запрос.УстановитьПараметр("ХарактеристикаПерсонала", ХарактеристикаПерсонала);
	Запрос.УстановитьПараметр("ЗначениеХарактеристики", ЗначениеХарактеристики);
	Запрос.УстановитьПараметр("ОбъектОценки", ОбъектОценки);
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат 0;
	Иначе
		РезультатЗапроса = Результат.Выгрузить();;
		Возврат РезультатЗапроса[0].Балл;
	КонецЕсли;
	
КонецФункции

Процедура ПриЗакрытииФормыЭлектронногоКурса(ЭлектронныйКурс, Контекст, ЛичныеДанныеКандидата, ИзучениеЭлектронногоКурса,
	СтандартнаяОбработка) Экспорт

	Если Не ТипЗнч(Контекст) = Тип("СправочникСсылка.Вакансии") Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	
	УстановитьПривилегированныйРежим(Истина);
	ДанныеОбИзучении = ИзучениеЭлектронныхКурсов.ДанныеОбИзученииЭлектронногоКурса(ИзучениеЭлектронногоКурса, Истина);
	Если ДанныеОбИзучении.Завершено =Ложь Тогда
		Возврат;
	КонецЕсли;
	
	ВыбранныеВариантыОтветов = ВыбранныеВариантыОтветовТеста(ДанныеОбИзучении);
	
	ТаблицаКандидатов = ПодборПерсонала.КандидатыПоЛичнымДаннымКандидатов(
		ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ЛичныеДанныеКандидата));
	Кандидат = ТаблицаКандидатов[0].Кандидат;
	МассивКандидатов = Новый Массив;
	МассивКандидатов.Добавить(ТаблицаКандидатов[0].Кандидат);
	ЭтапРаботы = ПодборПерсонала.ТекущийЭтапРаботыКандидатов(МассивКандидатов);
	
	ОбновитьСтатистикуИзученияЭлектронногоТеста(Контекст, ВыбранныеВариантыОтветов, ЛичныеДанныеКандидата, ЭтапРаботы,
		МассивКандидатов);
	ЗавершитьЭтапРаботыСКандидатом(Кандидат, ЭтапРаботы);
	
КонецПроцедуры

Функция СоздатьВнешнихПользователейИОтправитьПриглашение(Кандидаты, ОтправлятьПриглашение,
	ШаблонСообщения = Неопределено) Экспорт

	СоответствиеЛичныхДанныхКандидатов = Справочники.Кандидаты.ЛичныеДанныеКандидатов(Кандидаты);
	ЛичныеДанныеКандидатов = Новый Массив;
	Для Каждого ЛичныеДанныеКандидата Из СоответствиеЛичныхДанныхКандидатов Цикл
		ЛичныеДанныеКандидатов.Добавить(ЛичныеДанныеКандидата.Значение);
	КонецЦикла;

	Если ОтправлятьПриглашение Тогда
		ЭлектронныеАдреса = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъектов(ЛичныеДанныеКандидатов,
			Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты,
			Справочники.ВидыКонтактнойИнформации.EMailЛичныеДанныеКандидатов);
	КонецЕсли;

	УстановитьПривилегированныйРежим(Истина);
	ГруппаДоступа = Константы.ГруппаДоступаВнешнегоПользователяЭлектронногоТестирования.Получить();
	Если Не ЗначениеЗаполнено(ГруппаДоступа) Тогда
		ВызватьИсключение НСтр(
			"ru = 'В настройках программы не указана группа доступа для создания внешних пользователей кандидатов.'");
	КонецЕсли;

	ВнешниеПользователиКандидатов = ВнешниеПользователиКандидатов(ЛичныеДанныеКандидатов);

	ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъектов(ЛичныеДанныеКандидатов, "Фамилия, Имя, Отчество");

	СозданныеПользователи = Новый Массив;

	Для Каждого Кандидат Из Кандидаты Цикл
		
		Пароль = Пользователи.СоздатьПароль(8, Истина, "ДляВнешнихПользователей");
		ЛичныеДанныеКандидата = СоответствиеЛичныхДанныхКандидатов[Кандидат];
		ВнешнийПользователь = ВнешниеПользователиКандидатов[ЛичныеДанныеКандидата];
		Если ВнешнийПользователь <> Неопределено Тогда
			ИдентификаторПользователяИБ = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВнешнийПользователь,
				"ИдентификаторПользователяИБ");
			СвойстваПользователя = Пользователи.СвойстваПользователяИБ(ИдентификаторПользователяИБ);
			ИмяПользователя = СвойстваПользователя.Имя;
			ОбновляемыеСвойства = Новый Структура("Пароль", Пароль);
			Пользователи.УстановитьСвойстваПользователяИБ(ИдентификаторПользователяИБ, ОбновляемыеСвойства, Ложь,
				Истина);
		Иначе
			РеквизитыКандидата = ЗначенияРеквизитов.Получить(ЛичныеДанныеКандидата);
			Если РеквизитыКандидата <> Неопределено Тогда
				ИмяПользователя = СвободноеИмяПользователя(РеквизитыКандидата.Фамилия, РеквизитыКандидата.Имя,
					РеквизитыКандидата.Отчество, " (2)");
				СозданныеПользователи.Добавить(НовыйВнешнийПользователь(ИмяПользователя, Пароль, ЛичныеДанныеКандидата));
			КонецЕсли;
		КонецЕсли;
		
		Если ОтправлятьПриглашение Тогда
			ЭлектронныеАдресаТекущие = ЭлектронныеАдреса.НайтиСтроки(ПараметрыОтбора(ЛичныеДанныеКандидата));
			Если ЭлектронныеАдресаТекущие.Количество() > 0 Тогда
				АдресЭП = ЭлектронныеАдресаТекущие[0].Представление;
			Иначе
				ВызватьИсключение СтрШаблон(НСтр(
					"ru = 'У кандидата %1 не заполнен адрес электронной почты'"), Строка(Кандидат));
			КонецЕсли;
			ОтправитьПриглашениеВнешнемуПользователю(ШаблонСообщения, ИмяПользователя, Пароль, Кандидат, АдресЭП);
		КонецЕсли;
		
	КонецЦикла;

	УстановитьГруппуДоступаВнешнимПользователямКандидатам(СозданныеПользователи, ГруппаДоступа);

	ПриглашенныеКандидаты = Новый Структура;
	ПриглашенныеКандидаты.Вставить("МассивПользователей", СозданныеПользователи);
	ПриглашенныеКандидаты.Вставить("ВебСсылкаПереходаВСистему", ВебСсылкаПереходаВСистему(ИмяПользователя, Пароль));
	ПриглашенныеКандидаты.Вставить("ИмяПользователя", ИмяПользователя);
	ПриглашенныеКандидаты.Вставить("Пароль", Пароль);

	Возврат ПриглашенныеКандидаты;

КонецФункции

// Возвращаемое значение:
//  Структура:
// * ИмяОтчество - Строка -
// * Кандидат - СправочникСсылка.Кандидаты -
Функция НовыйДанныеДляФормыЭлектронногоТестированияКандидата() Экспорт
	Возврат Новый Структура("ИмяОтчество, Кандидат", "", Справочники.Кандидаты.ПустаяСсылка());
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ОписаниеПрофиляКандидат()

	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Наименование  = НСтр("ru = 'Кандидаты'");
	ОписаниеПрофиля.Идентификатор = ИдентификаторПрофиляКандидат();
	ОписаниеПрофиля.Назначение = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(
		Метаданные.ОпределяемыеТипы.ВнешнийПользователь.Тип);
	ОписаниеПрофиля.Описание = НСтр(
		"ru = 'Профиль для доступа кандидатов к системе для прохождения электронного тестирования'");

	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля,
		"ЭлектронноеТестированиеКандидатовВнешнийПользовательБазовыеПрава");
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "БазовыеПраваВнешнихПользователейБСП");
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "ЗапускВебКлиента");
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "ЗапускТонкогоКлиента");
	// Электронное обучение.
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "БазовыеПраваЭлектронногоОбучения",
		"ЗарплатаКадрыКорпоративнаяПодсистемы.ЭлектронноеОбучение");

	Возврат ОписаниеПрофиля;

КонецФункции

Функция ИдентификаторПрофиляКандидат()

	Возврат "180337a4-76a7-11eb-a40b-4cedfb950ad7";

КонецФункции

Процедура ОбновитьСтатистикуИзученияЭлектронногоТеста(Вакансия, ВыбранныеВариантыОтветов, ЛичныеДанныеКандидата,
	ЭтапРаботы, МассивКандидатов)
	
	ДанныеВакансии = Справочники.Вакансии.ДанныеВакансии(Вакансия);
	ВакансияСоответствуетПрофилю = ДанныеВакансии.СоответствуетПрофилюДолжности;
	ВакансияПрофильДолжности = ДанныеВакансии.ПрофильДолжности;
	Если ВакансияСоответствуетПрофилю Тогда
		Объект = ВакансияПрофильДолжности;
	Иначе
		Объект = Вакансия;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		 "ВЫБРАТЬ
		 |	НастройкаВопросовДляЭлектронногоТестирования.ХарактеристикаПерсонала КАК ХарактеристикаПерсонала,
		 |	НастройкаВопросовДляЭлектронногоТестирования.ЗначениеХарактеристики КАК ЗначениеХарактеристики,
		 |	СУММА(НастройкаВопросовДляЭлектронногоТестирования.Балл) КАК МаксимальныйБалл
		 |ПОМЕСТИТЬ ВТМаксимальныеБаллы
		 |ИЗ
		 |	РегистрСведений.НастройкаВопросовДляЭлектронногоТестирования КАК НастройкаВопросовДляЭлектронногоТестирования
		 |ГДЕ
		 |	НастройкаВопросовДляЭлектронногоТестирования.Объект = &Объект
		 |СГРУППИРОВАТЬ ПО
		 |	НастройкаВопросовДляЭлектронногоТестирования.ХарактеристикаПерсонала,
		 |	НастройкаВопросовДляЭлектронногоТестирования.ЗначениеХарактеристики
		 |;
		 |
		 |////////////////////////////////////////////////////////////////////////////////
		 |ВЫБРАТЬ
		 |	НастройкаВопросовДляЭлектронногоТестирования.ХарактеристикаПерсонала КАК ХарактеристикаПерсонала,
		 |	НастройкаВопросовДляЭлектронногоТестирования.ЗначениеХарактеристики КАК ЗначениеХарактеристики,
		 |	СУММА(НастройкаВопросовДляЭлектронногоТестирования.Балл) КАК НабранныйБалл
		 |ПОМЕСТИТЬ ВТОтветыНаТест
		 |ИЗ
		 |	РегистрСведений.НастройкаВопросовДляЭлектронногоТестирования КАК НастройкаВопросовДляЭлектронногоТестирования
		 |ГДЕ
		 |	НастройкаВопросовДляЭлектронногоТестирования.Объект = &Объект
		 |	И НастройкаВопросовДляЭлектронногоТестирования.ВариантОтвета В (&ОтветыНаВопросы)
		 |СГРУППИРОВАТЬ ПО
		 |	НастройкаВопросовДляЭлектронногоТестирования.ЗначениеХарактеристики,
		 |	НастройкаВопросовДляЭлектронногоТестирования.ХарактеристикаПерсонала
		 |;
		 |
		 |////////////////////////////////////////////////////////////////////////////////
		 |ВЫБРАТЬ
		 |	ВТМаксимальныеБаллы.ХарактеристикаПерсонала КАК ХарактеристикаПерсонала,
		 |	ВТМаксимальныеБаллы.ЗначениеХарактеристики КАК ЗначениеХарактеристики,
		 |	ЕСТЬNULL(ВТОтветыНаТест.НабранныйБалл, 0) КАК НабранныйБалл,
		 |	ЕСТЬNULL(ВТМаксимальныеБаллы.МаксимальныйБалл, 0) КАК МаксимальныйБалл
		 |ИЗ
		 |	ВТМаксимальныеБаллы КАК ВТМаксимальныеБаллы
		 |		ЛЕВОЕ СОЕДИНЕНИЕ ВТОтветыНаТест КАК ВТОтветыНаТест
		 |		ПО ВТМаксимальныеБаллы.ХарактеристикаПерсонала = ВТОтветыНаТест.ХарактеристикаПерсонала
		 |		И ВТМаксимальныеБаллы.ЗначениеХарактеристики = ВТОтветыНаТест.ЗначениеХарактеристики";
	Запрос.УстановитьПараметр("Объект", Объект);
	Запрос.УстановитьПараметр("ОтветыНаВопросы", ВыбранныеВариантыОтветов);
	Результат = Запрос.Выполнить().Выбрать();
	НаборХарактеристик = РегистрыСведений.ХарактеристикиФизическихЛиц.СоздатьНаборЗаписей();
	НаборХарактеристик.Отбор.Вакансия.Установить(Вакансия);
	НаборХарактеристик.Отбор.ФизическоеЛицо.Установить(ЛичныеДанныеКандидата);
	НаборХарактеристик.Отбор.Этап.Установить(ЭтапРаботы);
	НаборХарактеристик.Прочитать();
	Если НаборХарактеристик.Количество() > 0 Тогда
		НаборХарактеристик.Очистить();
	КонецЕсли;
	Пока Результат.Следующий() Цикл
		Запись = НаборХарактеристик.Добавить();
		ЗаполнитьЗначенияСвойств(Запись, Результат);
		Запись.Период = ТекущаяДатаСеанса();
		Запись.Вакансия = Вакансия;
		Запись.Этап = ЭтапРаботы;
		Запись.ФизическоеЛицо = ЛичныеДанныеКандидата;
		Если Результат.МаксимальныйБалл = 0 Тогда
			Запись.Балл = 0;
		Иначе
			Запись.Балл = Результат.НабранныйБалл / Результат.МаксимальныйБалл * 100;
		КонецЕсли;
		Запись.СпособОценкиХарактеристик = Перечисления.СпособыОценкиХарактеристик.ЭлектронныйТест;
	КонецЦикла;
	НаборХарактеристик.Записать();
	
	ЭлектронноеИнтервью.РассчитатьОценкиКандидатов(Вакансия, МассивКандидатов);
	
КонецПроцедуры

Процедура ЗавершитьЭтапРаботыСКандидатом(Кандидат, ЭтапРаботы)
	
	УстановитьПривилегированныйРежим(Истина);
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	РаботаСКандидатами.Период КАК Период,
		|	РаботаСКандидатами.ПериодОкончание КАК ПериодОкончание
		|ИЗ
		|	РегистрСведений.РаботаСКандидатами КАК РаботаСКандидатами
		|ГДЕ
		|	РаботаСКандидатами.Кандидат = &Кандидат
		|	И РаботаСКандидатами.ЭтапРаботы = &ЭтапРаботы";
	Запрос.УстановитьПараметр("Кандидат", Кандидат);
	Запрос.УстановитьПараметр("ЭтапРаботы", ЭтапРаботы);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ОписаниеЭтапа = ПодборПерсоналаКлиентСервер.ОписаниеЭтапаРаботыСКандидатом();
		ОписаниеЭтапа.Этап = ЭтапРаботы;
		ОписаниеЭтапа.Состояние = Перечисления.СостоянияЭтаповРаботыСКандидатами.Пройден;
		ОписаниеЭтапа.Период = ТекущаяДатаСеанса();
		ПрежниеДанныеЭтапа = Справочники.ЭтапыРаботыСКандидатами.СтруктураДанныхПланированияЭтапа();
		ЗаполнитьЗначенияСвойств(ПрежниеДанныеЭтапа, Выборка);
		ПодборПерсонала.УстановитьСостояниеЭтапаРаботыКандидата(Кандидат, ОписаниеЭтапа, ПрежниеДанныеЭтапа);
	КонецЦикла;
	
КонецПроцедуры

Функция ВыбранныеВариантыОтветовТеста(ДанныеОбИзучении)

	УстановитьПривилегированныйРежим(Истина);
	ВыбранныеВариантыОтветов = Новый Массив;

	Для Каждого Тест Из ДанныеОбИзучении.ИзученныеЭлементы Цикл
		ПопыткиИзучений = Тест.ПопыткиИзучения;
		КоличествоПопыток = ПопыткиИзучений.Количество();
		ПоследняяПопытка = ПопыткиИзучений[КоличествоПопыток - 1];
		Для Каждого ОтветНаВопрос Из ПоследняяПопытка.ОтветыНаТестовыеВопросы Цикл
			Для Каждого ВыбранныйВариант Из ОтветНаВопрос.ВыбранныеВариантыОтветов Цикл
				Если ВыбранныйВариант.Выбран Тогда
					ВыбранныеВариантыОтветов.Добавить(ВыбранныйВариант.ВариантОтвета);
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;

	Возврат ВыбранныеВариантыОтветов;

КонецФункции

Процедура СоздатьИЗаполнитьГруппуДоступаВнешнегоПользователяКандидата()

	ПрофильКандидат = Справочники.ПрофилиГруппДоступа.НайтиПоРеквизиту("ИдентификаторПоставляемыхДанных",
		Новый УникальныйИдентификатор(ИдентификаторПрофиляКандидат()));
	Если ПрофильКандидат = Справочники.ПрофилиГруппДоступа.ПустаяСсылка() Тогда
		Возврат;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
				   |	ГруппыДоступа.Ссылка
				   |ИЗ
				   |	Справочник.ГруппыДоступа КАК ГруппыДоступа
				   |ГДЕ
				   |	ГруппыДоступа.Профиль = &Профиль";
	Запрос.УстановитьПараметр("Профиль", ПрофильКандидат);
	Если Не Запрос.Выполнить().Пустой() Тогда
		Возврат;
	КонецЕсли;

	ГруппаДоступаОбъект = Справочники.ГруппыДоступа.СоздатьЭлемент();
	ГруппаДоступаОбъект.Наименование = НСтр("ru = 'Кандидаты'");
	ПрофильКандидата = ПрофильКандидат;
	ГруппаДоступаОбъект.Профиль = ПрофильКандидата;
	ОбновлениеИнформационнойБазы.ЗаписатьОбъект(ГруппаДоступаОбъект);

	Константы.ГруппаДоступаВнешнегоПользователяЭлектронногоТестирования.Установить(ГруппаДоступаОбъект.Ссылка);

КонецПроцедуры

// Параметры:
//  ЛичныеДанныеКандидатов - Массив из СправочникСсылка.ЛичныеДанныеКандидатов
// 
// Возвращаемое значение:
//  Соответствие:
//    * Ключ - СправочникСсылка.ЛичныеДанныеКандидатов
//    * Значение - СправочникСсылка.ВнешниеПользователи
Функция ВнешниеПользователиКандидатов(ЛичныеДанныеКандидатов)

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ЛичныеДанныеКандидатов", ЛичныеДанныеКандидатов);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВнешниеПользователи.ОбъектАвторизации КАК ОбъектАвторизации,
	|	ВнешниеПользователи.Ссылка КАК Пользователь
	|ИЗ
	|	Справочник.ВнешниеПользователи КАК ВнешниеПользователи
	|ГДЕ
	|	ВнешниеПользователи.ОбъектАвторизации В (&ЛичныеДанныеКандидатов)";
	Выборка = Запрос.Выполнить().Выбрать();

	ДанныеПользователей = Новый Соответствие;
	Пока Выборка.Следующий() Цикл
		ДанныеПользователей.Вставить(Выборка.ОбъектАвторизации, Выборка.Пользователь);
	КонецЦикла;

	Возврат ДанныеПользователей;

КонецФункции

Функция СвободноеИмяПользователя(Фамилия, Имя, Отчество, Постфикс = Неопределено)

	ВозможныеЗначения = Новый Массив;

	ВозможныеЗначения.Добавить(Фамилия + Лев(Имя, 1) + Лев(Отчество, 1));
	Если ЗначениеЗаполнено(Постфикс) Тогда
		ВозможныеЗначения.Добавить(Фамилия + Лев(Имя, 1) + Лев(Отчество, 1) + " " + Постфикс);
	КонецЕсли;

	ВозможныеЗначения.Добавить(Фамилия);
	Если ЗначениеЗаполнено(Постфикс) Тогда
		ВозможныеЗначения.Добавить(Фамилия + " " + Постфикс);
	КонецЕсли;

	ВозможныеЗначения.Добавить(Фамилия + " " + Имя + " " + Отчество);
	Если ЗначениеЗаполнено(Постфикс) Тогда
		ВозможныеЗначения.Добавить(Фамилия + " " + Имя + " " + Отчество + " " + Постфикс);
	КонецЕсли;

	ВозможныеЗначения.Добавить(Фамилия + " " + Имя);
	Если ЗначениеЗаполнено(Постфикс) Тогда
		ВозможныеЗначения.Добавить(Фамилия + " " + Имя + " " + Постфикс);
	КонецЕсли;

	ВозможныеЗначения.Добавить(Фамилия + " " + Имя + " " + Лев(Отчество, 1));
	Если ЗначениеЗаполнено(Постфикс) Тогда
		ВозможныеЗначения.Добавить(Фамилия + " " + Имя + " " + Лев(Отчество, 1) + " " + Постфикс);
	КонецЕсли;

	ВозможныеЗначения.Добавить(Фамилия + Лев(Имя, 4) + Лев(Отчество, 4));
	Если ЗначениеЗаполнено(Постфикс) Тогда
		ВозможныеЗначения.Добавить(Фамилия + Лев(Имя, 4) + Лев(Отчество, 4) + " " + Постфикс);
	КонецЕсли;

	ТекстЗапроса =
		"ВЫБРАТЬ
		|	ВнешниеПользователи.Наименование
		|ИЗ
		|	Справочник.ВнешниеПользователи КАК ВнешниеПользователи
		|ГДЕ
		|	ВнешниеПользователи.Наименование В(&ВозможныеЗначения)";

	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("ВозможныеЗначения", ВозможныеЗначения);
	Выборка = Запрос.Выполнить().Выбрать();

	ЗанятыеЗначения = Новый Соответствие;
	Пока Выборка.Следующий() Цикл
		ЗанятыеЗначения.Вставить(СокрЛП(Выборка.Наименование), Истина);
	КонецЦикла;

	Для Каждого ИмяПользователя Из ВозможныеЗначения Цикл
		Если ЗанятыеЗначения[ИмяПользователя] = Неопределено Тогда
			Возврат ИмяПользователя;
		КонецЕсли;
	КонецЦикла;

	Возврат Неопределено;

КонецФункции

Процедура ОтправитьПриглашениеВнешнемуПользователю(ШаблонСообщения, ПользовательИБ, Пароль, Кандидат, АдресЭП)

	Если Не ЗначениеЗаполнено(ШаблонСообщения) Тогда
		ШаблонСообщения = ШаблонСообщенияПриглашения();
	КонецЕсли;

	СписокАдресатов = Новый ТаблицаЗначений;
	СписокАдресатов.Колонки.Добавить("Адрес");
	СписокАдресатов.Колонки.Добавить("Представление");
	СписокАдресатов.Колонки.Добавить("Контакт");
	НоваяСтрока = СписокАдресатов.Добавить();
	НоваяСтрока.Адрес = АдресЭП;
	НоваяСтрока.Представление = АдресЭП;

	ПередаваемыеПараметры = Новый Структура;
	ПередаваемыеПараметры.Вставить("Получатели", СписокАдресатов);
	ПередаваемыеПараметры.Вставить("ПерезаполнятьПолучателей", Истина);
	ПередаваемыеПараметры.Вставить("УчетнаяЗапись", РаботаСПочтовымиСообщениями.СистемнаяУчетнаяЗапись());
	ПередаваемыеПараметры.Вставить("ВебСсылкаПереходаВСистему", ВебСсылкаПереходаВСистему(ПользовательИБ, Пароль));
	ПередаваемыеПараметры.Вставить("ИмяПользователяИБ", ПользовательИБ);
	ПередаваемыеПараметры.Вставить("Пароль", Пароль);

	РезультатОтправки = ШаблоныСообщений.СформироватьСообщениеИОтправить(
		ШаблонСообщения, Кандидат, Новый УникальныйИдентификатор, ПередаваемыеПараметры);
	Если ЗначениеЗаполнено(РезультатОтправки.ОписаниеОшибки) Тогда
		ОбщегоНазначения.СообщитьПользователю(РезультатОтправки.ОписаниеОшибки);
	КонецЕсли;

КонецПроцедуры

Функция ШаблонСообщенияПриглашения()

	Отбор = Новый Структура("ВладелецШаблона, ПредназначенДляЭлектронныхПисем");
	Отбор.ВладелецШаблона = ПредопределенноеЗначение(
		"Перечисление.ИспользованиеШаблоновСообщенийПриПодбореПерсонала.ПриглашениеНаЭлектронноеТестирование");
	Отбор.ПредназначенДляЭлектронныхПисем = Истина;
	Шаблоны = ПодборПерсонала.ШаблоныСообщенийКандидатов(Отбор);
	Если Шаблоны.Количество() = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;
	Возврат Шаблоны[0].Ссылка;

КонецФункции

Функция ВебСсылкаПереходаВСистему(ИмяПользователя, Пароль)

	АдресВебСервера = ОбщегоНазначения.АдресПубликацииИнформационнойБазыВИнтернете();

	Если Не ЗначениеЗаполнено(АдресВебСервера) Тогда
		Возврат "";
	КонецЕсли;

	ЧастиСтроки = Новый Массив;
	ЧастиСтроки.Добавить(АдресВебСервера);
	ЧастиСтроки.Добавить(?(СтрЗаканчиваетсяНа(СокрЛП(АдресВебСервера), "/"), "", "/"));
	ЧастиСтроки.Добавить(КодироватьСтроку(СтрШаблон("?N=%1", ИмяПользователя), СпособКодированияСтроки.URLВКодировкеURL));
	ЧастиСтроки.Добавить(КодироватьСтроку(СтрШаблон("&P=%1", Пароль), СпособКодированияСтроки.URLВКодировкеURL));
	
	Возврат СтрСоединить(ЧастиСтроки);

КонецФункции

Функция НовыйВнешнийПользователь(ИмяПользователя, Пароль, ОбъектАвторизации)

	ОписаниеПользователяИБ = Пользователи.НовоеОписаниеПользователяИБ();
	ОписаниеПользователяИБ.Имя = ИмяПользователя;
	ОписаниеПользователяИБ.ПолноеИмя = ИмяПользователя;
	ОписаниеПользователяИБ.АутентификацияСтандартная = Истина;
	ОписаниеПользователяИБ.ПоказыватьВСпискеВыбора = Ложь;
	ОписаниеПользователяИБ.ЗапрещеноИзменятьПароль = Истина;
	ОписаниеПользователяИБ.АутентификацияOpenID = Ложь;
	ОписаниеПользователяИБ.АутентификацияОС = Ложь;
	ОписаниеПользователяИБ.Пароль = Пароль;
	ОписаниеПользователяИБ.Вставить("Действие", "Записать");

	Пользователь = Справочники.ВнешниеПользователи.СоздатьЭлемент();
	Пользователь.Наименование = ОписаниеПользователяИБ.ПолноеИмя;
	Пользователь.ОбъектАвторизации = ОбъектАвторизации;
	Пользователь.ДополнительныеСвойства.Вставить("ОписаниеПользователяИБ", ОписаниеПользователяИБ);
	Пользователь.Записать();

	Возврат Пользователь.Ссылка;

КонецФункции

Процедура УстановитьГруппуДоступаВнешнимПользователямКандидатам(Пользователи, ГруппаДоступа)

	Если Пользователи.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;

	ГруппаДоступаОбъект = ГруппаДоступа.ПолучитьОбъект();
	Для Каждого СозданныйПользователь Из Пользователи Цикл
		ГруппаДоступаОбъект.Пользователи.Добавить().Пользователь = СозданныйПользователь;
	КонецЦикла;
	ГруппаДоступаОбъект.Записать();

КонецПроцедуры

Функция ПараметрыОтбора(Объект)

	Возврат Новый Структура("Объект", Объект);

КонецФункции

Функция ТаблицаОтветов()
	
	ОтветыТеста = Новый ТаблицаЗначений;
	
	МассивТиповОбъекта = Новый Массив;
	МассивТиповОбъекта.Добавить(Тип("СправочникСсылка.Вакансии"));
	МассивТиповОбъекта.Добавить(Тип("СправочникСсылка.ПрофилиДолжностей"));
	ОтветыТеста.Колонки.Добавить("Объект", Новый ОписаниеТипов(МассивТиповОбъекта));
	ОтветыТеста.Колонки.Добавить("ЭлектронныйКурс", Новый ОписаниеТипов("СправочникСсылка.ЭлектронныеКурсы"));
	ОтветыТеста.Колонки.Добавить("ЛичныеДанныеКандидата", Новый ОписаниеТипов("СправочникСсылка.ЛичныеДанныеКандидатов"));
	ОтветыТеста.Колонки.Добавить("Вопрос", Новый ОписаниеТипов("СправочникСсылка.ТестовыеВопросы"));
	ОтветыТеста.Колонки.Добавить("ВариантОтвета", Новый ОписаниеТипов("СправочникСсылка.ВариантыОтветовНаТестовыеВопросы"));
	ОтветыТеста.Колонки.Добавить("Выбран", Новый ОписаниеТипов("Булево"));
	ОтветыТеста.Колонки.Добавить("Вакансия", Новый ОписаниеТипов("СправочникСсылка.Вакансии"));
	ОтветыТеста.Колонки.Добавить("ЭтапРаботы", Новый ОписаниеТипов("СправочникСсылка.ЭтапыРаботыСКандидатами"));
	
	Возврат ОтветыТеста;
	
КонецФункции

Функция ТестыСЭтапамиРабот(Вакансия)
	
	Если Не ЗначениеЗаполнено(Вакансия) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ВакансииЭтапыРаботыСКандидатами.ШаблонАнкеты КАК ЭлектронныйКурс,
		|	ВакансииЭтапыРаботыСКандидатами.ЭтапРаботы КАК ЭтапРаботы
		|ИЗ
		|	Справочник.Вакансии.ЭтапыРаботыСКандидатами КАК ВакансииЭтапыРаботыСКандидатами
		|ГДЕ
		|	ВакансииЭтапыРаботыСКандидатами.СпособОценкиХарактеристик = ЗНАЧЕНИЕ(Перечисление.СпособыОценкиХарактеристик.ЭлектронныйТест)
		|	И ВакансииЭтапыРаботыСКандидатами.Ссылка = &Вакансия";
	Запрос.УстановитьПараметр("Вакансия", Вакансия);
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат Неопределено;
	Иначе
		Возврат Результат.Выгрузить();
	КонецЕсли;
	
КонецФункции

#КонецОбласти
